In [8]:
import numpy as np
import pandas as pd
# Groupby allows you to group together rows based off of a column
# and perform an aggregate function on them

In [13]:
data  = {'Company':['GOOG','GOOG',"Heke","SHSADHS","Jab","Maz"],
        'Person':['sam','Ram','Lakxman','Sita','Gita','Mita'],
        'Sales':[100,120,124,125,125,122]}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

   Company   Person  Sales
0     GOOG      sam    100
1     GOOG      Ram    120
2     Heke  Lakxman    124
3  SHSADHS     Sita    125
4      Jab     Gita    125
5      Maz     Mita    122

In [18]:
byComp = df.groupby('Company')

In [19]:
byComp.mean()

         Sales
Company
GOOG       110
Heke       124
Jab        125
Maz        122
SHSADHS    125

In [20]:
byComp.sum()

         Sales
Company
GOOG       220
Heke       124
Jab        125
Maz        122
SHSADHS    125

In [21]:
byComp.std()

             Sales
Company
GOOG     14.142136
Heke           NaN
Jab            NaN
Maz            NaN
SHSADHS        NaN

In [22]:
df.groupby('Company').sum().loc['GOOG']

Sales    220
Name: GOOG, dtype: int64

In [23]:
df.groupby('Company').describe()

                    Sales
Company
GOOG    count    2.000000
        mean   110.000000
        std     14.142136
        min    100.000000
        25%    105.000000
        50%    110.000000
        75%    115.000000
        max    120.000000
Heke    count    1.000000
        mean   124.000000
        std           NaN
        min    124.000000
        25%    124.000000
        50%    124.000000
        75%    124.000000
        max    124.000000
Jab     count    1.000000
        mean   125.000000
        std           NaN
        min    125.000000
        25%    125.000000
        50%    125.000000
        75%    125.000000
        max    125.000000
Maz     count    1.000000
        mean   122.000000
        std           NaN
        min    122.000000
        25%    122.000000
        50%    122.000000
        75%    122.000000
        max    122.000000
SHSADHS count    1.000000
        mean   125.000000
        std           NaN
        min    125.000000
        25%    125.000000
        50%    125.000000
        75%    125.000000
        max    125.000000

In [24]:
df.groupby('Company').describe().transpose()

Company  GOOG                                                       Heke  \
        count   mean        std    min    25%    50%    75%    max count
Sales     2.0  110.0  14.142136  100.0  105.0  110.0  115.0  120.0   1.0

Company         ...      Maz        SHSADHS                                  \
          mean  ...      75%    max   count   mean std    min    25%    50%
Sales    124.0  ...    122.0  122.0     1.0  125.0 NaN  125.0  125.0  125.0

Company
           75%    max
Sales    125.0  125.0

[1 rows x 40 columns]